<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"66d45af3e69e7558b84d3b24a4d561e5d3cdd0afc4f1b5dd6541cbe5b3be8eae","plan_job_ref":"Job Validations on PR #56 at https://github.com/SelfOverflow/discord-bots/actions/runs/22540517217","plan_out_hash":"637bb2bcdc3c2f9c63ef9bbf7eefcbe1b3d41843fc818f5495369625902ef847","plan_hash":"ff9006f548467149758a1c91e4e58d1a69936a84d1d0a24fb12ed8445da72ede","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "c7bb929858217ebc110313c1dd19a57f357ceca8"`
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.bot will be updated in-place
!~  resource "aws_ecs_service" "bot" {
        id                                 = "arn:aws:ecs:ap-south-1:613419461354:service/bablu-bot-cluster/bablu-bot-service"
        name                               = "bablu-bot-service"
        tags                               = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
!~      task_definition                    = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:6" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bot must be replaced
-/+ resource "aws_ecs_task_definition" "bot" {
!~      arn                      = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:6" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  image            = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:e57193d5bc04ebe94ba6845c4b058dfdd6ead3aa" -> "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:c7bb929858217ebc110313c1dd19a57f357ceca8"
-                   mountPoints      = []
                    name             = "bot"
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "**************" -> (known after apply)
!~      revision                 = 6 -> (known after apply)
        tags                     = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
#        (12 unchanged attributes hidden)
    }

  # aws_iam_policy.execution_secrets_policy will be updated in-place
!~  resource "aws_iam_policy" "execution_secrets_policy" {
        id               = "arn:aws:iam::613419461354:policy/bablu-bot-execution-secrets-policy"
        name             = "bablu-bot-execution-secrets-policy"
!~      policy           = jsonencode(
!~          {
!~              Statement = [
!~                  {
!~                      Resource = "arn:aws:secretsmanager:ap-south-1:613419461354:secret:bablu-bot-discord-token-clGJ1l" -> [
+                           "arn:aws:secretsmanager:ap-south-1:613419461354:secret:bablu-bot-discord-token-clGJ1l",
+                           "arn:aws:secretsmanager:ap-south-1:613419461354:secret:bablu-bot-app-id-0aLqF9",
                        ]
#                        (2 unchanged attributes hidden)
                    },
                ]
#                (1 unchanged attribute hidden)
            }
        )
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #34](https://github.com/SelfOverflow/discord-bots/actions/runs/22540553120)
<details><summary>Outputs</summary>

```hcl
dynamodb_table_name    = "bablu-bot-users"
ecr_repository_url     = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository"
ecs_cluster_name       = "bablu-bot-cluster"
ecs_execution_role_arn = "arn:aws:iam::613419461354:role/bablu-bot-ecs-execution-role"
ecs_security_group     = "sg-0d73227267aa70d86"
ecs_task_role_arn      = "arn:aws:iam::613419461354:role/bablu-bot-ecs-task-role"
public_subnets         = [
    "subnet-015fbb31ea79e0066",
    "subnet-0da3df806465ee531",
]
sqs_queue_url          = "https://sqs.ap-south-1.amazonaws.com/613419461354/bablu-bot-events"
vpc_id                 = "vpc-012652892da27fe36"
```
</details>